app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "hassan waseem"], ["body", "jkahcjsdg"], ["post_id", 9], ["created_at", "2022-05-02 10:53:54.524075"], ["updated_at", "2022-05-02 10:53:54.524075"]]