app/controllers/homes_controller.rb

    def homepage

     # @post_home=Post.order("created_at DESC")
     @post_home=Post.all
      if params[:query].present?

        @pagy, @post = pagy(Post.where("title LIKE ?", "%" + params[:query] + "%"),items: 3)

      else
        @pagy, @post = pagy(Post.all, page: params[:page],items: 3)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

    def create

        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "1 post"], ["description", "1 more post is in the way"], ["created_at", "2022-05-06 10:07:44.491330"], ["updated_at", "2022-05-06 10:07:44.491330"], ["image", "desktop_image2.png"]]

    def delete_post

      @post = Post.find(params[:id])
      @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 24]]

    def update
      @post = Post.find(params[:id])

      if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "hello post hggyyu"], ["updated_at", "2022-04-28 11:31:22.728916"], ["id", 1]]