app/controllers/homes_controller.rb

    def showpage
        @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
      @post = Post.find(params[:id])

      if @post.update(post_params)
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "jkdscuk ndschhfis hacbc"], ["updated_at", "2022-04-28 11:44:34.274580"], ["id", 6]]